# Dataframes

In [2]:
import pandas as pd

In [3]:
# create dataframe from dictionary, lists and series
#1
data_dict = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35]
}

# Create a DataFrame from the dictionary
df_from_dict = pd.DataFrame(data_dict)
print(df_from_dict,'\n')

#2
data_list = [
    ['Alice', 25],
    ['Bob', 30],
    ['Charlie', 35]
]

# Specify column names
columns = ['Name', 'Age']

# Create a DataFrame from the list
df_from_list = pd.DataFrame(data_list, columns=columns)

print(df_from_list, '\n')

#3 
names = pd.Series(['Alice', 'Bob', 'Charlie'], name='Name')
ages = pd.Series([25, 30, 35], name='Age')

# Create a DataFrame by combining them
# The concat function joins them along the columns (axis=1)
df_from_series = pd.concat([names, ages], axis=1)

print(df_from_series)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [5]:
names=['tom', 'pacino','lewis','vin','adam']
weights=[65,78,90,85,81]
actordata=list(zip(names,weights))
print(actordata)
df12=pd.DataFrame(data = actordata,columns=['Names','weights'])
print(df12)

[('tom', 65), ('pacino', 78), ('lewis', 90), ('vin', 85), ('adam', 81)]
    Names  weights
0     tom       65
1  pacino       78
2   lewis       90
3     vin       85
4    adam       81

## Storing and reading data to/from csv/excel files

In [6]:
#store data into a csv file
# dataframename.to_csv(csvfilename.csv)
df12.to_csv ('acdata.csv', index = False)
#df12.to_csv ('acdata1.csv')

In [8]:
# read data from the csv file
df3=pd.read_csv('acdata.csv',header=None)   # header none means panda will assume 1st row as data
df3.head(3)

        0        1
0   Names  weights
1     tom       65
2  pacino       78

## Data Cleaning
### Why do we need to clean data?
- Data is messy.
    - Even when conditions are controlled, data can be messy.
    - Most data you deal with will not be from controlled environments.

- It is often estimated that data science is 80% data cleaning, 20% analysis

- Data that we use in modeling must often be cleaned, transformed, and rearranged before use

- pandas was built to address some of the real-world needs of data processing

### Dealing with Missing Data
- Real world data often contains missing data. Reasons why may include:
    - it does not exist

    - it was not observed

    - errors
- There are theories on how to deal with missing data some examples:
    - fill numeric data with the mean
    - use catch all categories (e.g., 'did not response')
    - remove case wise or row wise
- In python, `NaN` or `NaT` represent missing data

#### Drop
- you can drop data when values are missing
    - how we drop data can impact the results of analyses due to decreased sample sizes

In [9]:
import numpy as np
import pandas as pd
df=pd.read_excel(r"CustomerBehavior2.xlsx") # 'r' before the string indicates a "raw string," 
# for file paths as it prevents backslashes from being interpreted as escape sequences.
df2=df.copy()
print(df2.head(),'\n')
print(df2['Quarter'])

   Name    Year  Quarter  Transaction  Spent  Refunded
0  Jane  2021.0      4.0          1.0   31.0       NaN
1  Jane  2021.0      4.0          1.0   31.0       NaN
2  Jane  2022.0      1.0          1.0   53.0       NaN
3  Jane     NaN      NaN          2.0   41.0       NaN
4  Jane     NaN      2.0          1.0   37.0       NaN

0     4.0
1     4.0
2     1.0
3     NaN
4     2.0
5     3.0
6     NaN
7     NaN
8     4.0
9     4.0
10    NaN
11    1.0
12    NaN
13    3.0
14    NaN
15    4.0
16    1.0
17    2.0
18    3.0
19    NaN
20    3.0
Name: Quarter, dtype: float64

In [10]:
df2.describe() # descriptive statistics

              Year    Quarter  Transaction      Spent   Refunded
count    10.000000  14.000000    20.000000  17.000000   3.000000
mean   2021.500000   2.785714     1.350000  42.647059  25.666667
std       0.527046   1.188313     0.587143   9.013470  13.796135
min    2021.000000   1.000000     1.000000  31.000000  10.000000
25%    2021.000000   2.000000     1.000000  35.000000  20.500000
50%    2021.500000   3.000000     1.000000  41.000000  31.000000
75%    2022.000000   4.000000     2.000000  50.000000  33.500000
max    2022.000000   4.000000     3.000000  57.000000  36.000000

In [13]:
#.dropna() - drops missing data, you can specify how
df2=df2.dropna(how='all') #all data must be missing in a row for it to be dropped
print(df2, '\n')

#print(df2.dropna()) #drops rows with any missing data
#produces an empty DataFrame since all rows have some missing data

      Name    Year  Quarter  Transaction  Spent  Refunded
0     Jane  2021.0      4.0          1.0   31.0       NaN
1     Jane  2021.0      4.0          1.0   31.0       NaN
2     Jane  2022.0      1.0          1.0   53.0       NaN
3     Jane     NaN      NaN          2.0   41.0       NaN
4     Jane     NaN      2.0          1.0   37.0       NaN
5     Adam  2022.0      3.0          1.0   32.0       NaN
6     Adam     NaN      NaN          2.0   34.0       NaN
7     Adam     NaN      NaN          3.0   39.0       NaN
8   George  2021.0      4.0          1.0   56.0       NaN
9   George  2021.0      4.0          1.0   56.0       NaN
10  George     NaN      NaN          2.0    NaN      36.0
11  George  2022.0      1.0          1.0   35.0       NaN
12  George     NaN      NaN          2.0    NaN      10.0
13  George     NaN      3.0          1.0   43.0       NaN
15   Sally  2021.0      4.0          1.0   50.0       NaN
16   Sally  2022.0      1.0          1.0   44.0       NaN
17   Sally     NaN      2.0          1.0   45.0       NaN
18   Sally     NaN      3.0          1.0   57.0       NaN
19   Sally     NaN      NaN          2.0    NaN      31.0
20   Trish  2022.0      3.0          1.0   41.0       NaN

In [42]:
# more on dropna
dfnew1 = pd.DataFrame({
    'Customer_ID': [101, 102, np.nan, 104, np.nan],
    'Name': ['Alice', 'Bob', 'Charlie', np.nan, 'Eve'],
    'Spent': [200, np.nan, 150, 300, np.nan]
})

print("Original DataFrame:\n", dfnew1,'\n')

df_cleaned1 = dfnew1.dropna(subset=['Customer_ID'])
print(df_cleaned1)

Original DataFrame:
    Customer_ID     Name  Spent
0        101.0    Alice  200.0
1        102.0      Bob    NaN
2          NaN  Charlie  150.0
3        104.0      NaN  300.0
4          NaN      Eve    NaN

   Customer_ID   Name  Spent
0        101.0  Alice  200.0
1        102.0    Bob    NaN
3        104.0    NaN  300.0

In [44]:
df_cleaned2 = df_cleaned1.dropna(thresh=3)
print(df_cleaned2)

   Customer_ID   Name  Spent
0        101.0  Alice  200.0

#### Fill missing values
- you can fill missing values instead of dropping address issues with decreased sample sizes
- can have an impact on analysis due to changes in values and distributions

In [14]:
#fillna - fills missing value
    #specify value to fill missing values
df2['Refunded']=df2['Refunded'].fillna(0)
print(df2.head(), '\n')

   Name    Year  Quarter  Transaction  Spent  Refunded
0  Jane  2021.0      4.0          1.0   31.0       0.0
1  Jane  2021.0      4.0          1.0   31.0       0.0
2  Jane  2022.0      1.0          1.0   53.0       0.0
3  Jane     NaN      NaN          2.0   41.0       0.0
4  Jane     NaN      2.0          1.0   37.0       0.0

In [15]:
#ffill - fills missing data with last known value
df2['Year']=df2['Year'].fillna(method='ffill')
print(df2.head())
#bfill - fills missing data with next known value
df2['Quarter']=df2['Quarter'].fillna(method='bfill')
print(df2.head())

   Name    Year  Quarter  Transaction  Spent  Refunded
0  Jane  2021.0      4.0          1.0   31.0       0.0
1  Jane  2021.0      4.0          1.0   31.0       0.0
2  Jane  2022.0      1.0          1.0   53.0       0.0
3  Jane  2022.0      NaN          2.0   41.0       0.0
4  Jane  2022.0      2.0          1.0   37.0       0.0
   Name    Year  Quarter  Transaction  Spent  Refunded
0  Jane  2021.0      4.0          1.0   31.0       0.0
1  Jane  2021.0      4.0          1.0   31.0       0.0
2  Jane  2022.0      1.0          1.0   53.0       0.0
3  Jane  2022.0      2.0          2.0   41.0       0.0
4  Jane  2022.0      2.0          1.0   37.0       0.0

C:\Users\mmray\AppData\Local\Temp\ipykernel_14412\489854593.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df2['Year']=df2['Year'].fillna(method='ffill')
C:\Users\mmray\AppData\Local\Temp\ipykernel_14412\489854593.py:5: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df2['Quarter']=df2['Quarter'].fillna(method='bfill')

In [16]:
#fillna with column average
df2['Spent']=df2['Spent'].fillna(df2['Spent'].mean())
print(df2, '\n')

      Name    Year  Quarter  Transaction      Spent  Refunded
0     Jane  2021.0      4.0          1.0  31.000000       0.0
1     Jane  2021.0      4.0          1.0  31.000000       0.0
2     Jane  2022.0      1.0          1.0  53.000000       0.0
3     Jane  2022.0      2.0          2.0  41.000000       0.0
4     Jane  2022.0      2.0          1.0  37.000000       0.0
5     Adam  2022.0      3.0          1.0  32.000000       0.0
6     Adam  2022.0      4.0          2.0  34.000000       0.0
7     Adam  2022.0      4.0          3.0  39.000000       0.0
8   George  2021.0      4.0          1.0  56.000000       0.0
9   George  2021.0      4.0          1.0  56.000000       0.0
10  George  2021.0      1.0          2.0  42.647059      36.0
11  George  2022.0      1.0          1.0  35.000000       0.0
12  George  2022.0      3.0          2.0  42.647059      10.0
13  George  2022.0      3.0          1.0  43.000000       0.0
15   Sally  2021.0      4.0          1.0  50.000000       0.0
16   Sally  2022.0      1.0          1.0  44.000000       0.0
17   Sally  2022.0      2.0          1.0  45.000000       0.0
18   Sally  2022.0      3.0          1.0  57.000000       0.0
19   Sally  2022.0      3.0          2.0  42.647059      31.0
20   Trish  2022.0      3.0          1.0  41.000000       0.0

#### Test missing values
- you can use .isnull() or .isna() functions to return a boolean indicating which values in your series are missing
- the inverse is .notnull() or .notna() which returns a boolean indicating which values in your series are NOT missing

In [5]:
#.isnull() - can also use .isna()
print(df2['Spent'].isnull(),'\n')
#print(df2['Spent'].isna(),'\n')

#.notnull() - can also use .notna()
print(df2['Spent'].notnull(),'\n')
#print(df2['Spent'].notna(),'\n')

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11    False
12     True
13    False
15    False
16    False
17    False
18    False
19     True
20    False
Name: Spent, dtype: bool

0      True
1      True
2      True
3      True
4      True
5      True
6      True
7      True
8      True
9      True
10    False
11     True
12    False
13     True
15     True
16     True
17     True
18     True
19    False
20     True
Name: Spent, dtype: bool

### Duplicates
- Data may contain duplicates for any number of reasons, a few examples:
    - coerced through merges
    - entry errors
    - the data in the row may not be exactly the same, but there may be repeated values in a column
- You should understand why your data contains duplicates to determine how to deal with duplicate rows

In [17]:
display(df2)

      Name    Year  Quarter  Transaction      Spent  Refunded
0     Jane  2021.0      4.0          1.0  31.000000       0.0
1     Jane  2021.0      4.0          1.0  31.000000       0.0
2     Jane  2022.0      1.0          1.0  53.000000       0.0
3     Jane  2022.0      2.0          2.0  41.000000       0.0
4     Jane  2022.0      2.0          1.0  37.000000       0.0
5     Adam  2022.0      3.0          1.0  32.000000       0.0
6     Adam  2022.0      4.0          2.0  34.000000       0.0
7     Adam  2022.0      4.0          3.0  39.000000       0.0
8   George  2021.0      4.0          1.0  56.000000       0.0
9   George  2021.0      4.0          1.0  56.000000       0.0
10  George  2021.0      1.0          2.0  42.647059      36.0
11  George  2022.0      1.0          1.0  35.000000       0.0
12  George  2022.0      3.0          2.0  42.647059      10.0
13  George  2022.0      3.0          1.0  43.000000       0.0
15   Sally  2021.0      4.0          1.0  50.000000       0.0
16   Sally  2022.0      1.0          1.0  44.000000       0.0
17   Sally  2022.0      2.0          1.0  45.000000       0.0
18   Sally  2022.0      3.0          1.0  57.000000       0.0
19   Sally  2022.0      3.0          2.0  42.647059      31.0
20   Trish  2022.0      3.0          1.0  41.000000       0.0

In [18]:
#accessing unique values of a column
print(df2['Name'].unique())

#testing if a value in a column is a duplicate (note: the first value is not considered duplicate)
print(df2['Name'].duplicated())

['Jane' 'Adam' 'George' 'Sally' 'Trish']
0     False
1      True
2      True
3      True
4      True
5     False
6      True
7      True
8     False
9      True
10     True
11     True
12     True
13     True
15    False
16     True
17     True
18     True
19     True
20    False
Name: Name, dtype: bool

In [19]:
#dropping duplicate values in a column
df2.drop_duplicates(['Name'])
    #by default, first record is kept. You can change this behavior with the keep command
#df2.drop_duplicates(['Name'], keep='last')

#drop records where the entire row is a duplicate
df2=df2.drop_duplicates()
print(df2)

      Name    Year  Quarter  Transaction      Spent  Refunded
0     Jane  2021.0      4.0          1.0  31.000000       0.0
2     Jane  2022.0      1.0          1.0  53.000000       0.0
3     Jane  2022.0      2.0          2.0  41.000000       0.0
4     Jane  2022.0      2.0          1.0  37.000000       0.0
5     Adam  2022.0      3.0          1.0  32.000000       0.0
6     Adam  2022.0      4.0          2.0  34.000000       0.0
7     Adam  2022.0      4.0          3.0  39.000000       0.0
8   George  2021.0      4.0          1.0  56.000000       0.0
10  George  2021.0      1.0          2.0  42.647059      36.0
11  George  2022.0      1.0          1.0  35.000000       0.0
12  George  2022.0      3.0          2.0  42.647059      10.0
13  George  2022.0      3.0          1.0  43.000000       0.0
15   Sally  2021.0      4.0          1.0  50.000000       0.0
16   Sally  2022.0      1.0          1.0  44.000000       0.0
17   Sally  2022.0      2.0          1.0  45.000000       0.0
18   Sally  2022.0      3.0          1.0  57.000000       0.0
19   Sally  2022.0      3.0          2.0  42.647059      31.0
20   Trish  2022.0      3.0          1.0  41.000000       0.0

### Replacing Values
- We can replace current values with new values during data cleaning
- We can also use current values to create new columns

In [20]:
#.replace()
df2['Name']=df2['Name'].replace('Trish','Trisha')
print(df2)

      Name    Year  Quarter  Transaction      Spent  Refunded
0     Jane  2021.0      4.0          1.0  31.000000       0.0
2     Jane  2022.0      1.0          1.0  53.000000       0.0
3     Jane  2022.0      2.0          2.0  41.000000       0.0
4     Jane  2022.0      2.0          1.0  37.000000       0.0
5     Adam  2022.0      3.0          1.0  32.000000       0.0
6     Adam  2022.0      4.0          2.0  34.000000       0.0
7     Adam  2022.0      4.0          3.0  39.000000       0.0
8   George  2021.0      4.0          1.0  56.000000       0.0
10  George  2021.0      1.0          2.0  42.647059      36.0
11  George  2022.0      1.0          1.0  35.000000       0.0
12  George  2022.0      3.0          2.0  42.647059      10.0
13  George  2022.0      3.0          1.0  43.000000       0.0
15   Sally  2021.0      4.0          1.0  50.000000       0.0
16   Sally  2022.0      1.0          1.0  44.000000       0.0
17   Sally  2022.0      2.0          1.0  45.000000       0.0
18   Sally  2022.0      3.0          1.0  57.000000       0.0
19   Sally  2022.0      3.0          2.0  42.647059      31.0
20  Trisha  2022.0      3.0          1.0  41.000000       0.0

In [21]:
#example of how to replace multiple values
print(df2['Quarter'].replace([4,3],5),'\n')
print(df2['Quarter'].replace([4,3],[5,6]),'\n')

0     5.0
2     1.0
3     2.0
4     2.0
5     5.0
6     5.0
7     5.0
8     5.0
10    1.0
11    1.0
12    5.0
13    5.0
15    5.0
16    1.0
17    2.0
18    5.0
19    5.0
20    5.0
Name: Quarter, dtype: float64

0     5.0
2     1.0
3     2.0
4     2.0
5     6.0
6     5.0
7     5.0
8     5.0
10    1.0
11    1.0
12    6.0
13    6.0
15    5.0
16    1.0
17    2.0
18    6.0
19    6.0
20    6.0
Name: Quarter, dtype: float64

In [22]:
# .map
iddict={'Jane':'12','Adam':'5','George':'7','Sally':'15', 'Trisha':'20'}
df2['CustID']=df2.Name.map(iddict)
print(df2)

      Name    Year  Quarter  Transaction      Spent  Refunded CustID
0     Jane  2021.0      4.0          1.0  31.000000       0.0     12
2     Jane  2022.0      1.0          1.0  53.000000       0.0     12
3     Jane  2022.0      2.0          2.0  41.000000       0.0     12
4     Jane  2022.0      2.0          1.0  37.000000       0.0     12
5     Adam  2022.0      3.0          1.0  32.000000       0.0      5
6     Adam  2022.0      4.0          2.0  34.000000       0.0      5
7     Adam  2022.0      4.0          3.0  39.000000       0.0      5
8   George  2021.0      4.0          1.0  56.000000       0.0      7
10  George  2021.0      1.0          2.0  42.647059      36.0      7
11  George  2022.0      1.0          1.0  35.000000       0.0      7
12  George  2022.0      3.0          2.0  42.647059      10.0      7
13  George  2022.0      3.0          1.0  43.000000       0.0      7
15   Sally  2021.0      4.0          1.0  50.000000       0.0     15
16   Sally  2022.0      1.0          1.0  44.000000       0.0     15
17   Sally  2022.0      2.0          1.0  45.000000       0.0     15
18   Sally  2022.0      3.0          1.0  57.000000       0.0     15
19   Sally  2022.0      3.0          2.0  42.647059      31.0     15
20  Trisha  2022.0      3.0          1.0  41.000000       0.0     20

### Rename Columns
- Rename columns by feeding a dictionary of Old:New column names to the .rename() command

In [28]:
#.rename()
print(df2.rename(columns={'CustID':'NameID'}))
    #can feed multiple Old:New vales
#print(df2.rename(columns={'CustID':'NameID', 'Spent':'CustCost'}))

      Name    Year  Quarter  Transaction      Spent  Refunded NameID
0     Jane  2021.0      4.0          1.0  31.000000       0.0     12
2     Jane  2022.0      1.0          1.0  53.000000       0.0     12
3     Jane  2022.0      2.0          2.0  41.000000       0.0     12
4     Jane  2022.0      2.0          1.0  37.000000       0.0     12
5     Adam  2022.0      3.0          1.0  32.000000       0.0      5
6     Adam  2022.0      4.0          2.0  34.000000       0.0      5
7     Adam  2022.0      4.0          3.0  39.000000       0.0      5
8   George  2021.0      4.0          1.0  56.000000       0.0      7
10  George  2021.0      1.0          2.0  42.647059      36.0      7
11  George  2022.0      1.0          1.0  35.000000       0.0      7
12  George  2022.0      3.0          2.0  42.647059      10.0      7
13  George  2022.0      3.0          1.0  43.000000       0.0      7
15   Sally  2021.0      4.0          1.0  50.000000       0.0     15
16   Sally  2022.0      1.0          1.0  44.000000       0.0     15
17   Sally  2022.0      2.0          1.0  45.000000       0.0     15
18   Sally  2022.0      3.0          1.0  57.000000       0.0     15
19   Sally  2022.0      3.0          2.0  42.647059      31.0     15
20  Trisha  2022.0      3.0          1.0  41.000000       0.0     20

### index manipulations
- DataFrames default to a index of 0 to Nrows-1
- The index does not typically update with other DataFrame manipulations
- There are commands we can use to change or manipulate the index

In [29]:
#set_index() can set the index from a column in a DataFrame
print(df2.set_index('Name'),'\n')
#the column will be dropped from the data set, you can change this behavior with drop=False
#print(df2.set_index('Name', drop=False))
#feeding a list of columns will create a hierarchial index
#print(df2.set_index(['Name','Quarter','Transaction'], drop=False))

          Year  Quarter  Transaction      Spent  Refunded CustID
Name
Jane    2021.0      4.0          1.0  31.000000       0.0     12
Jane    2022.0      1.0          1.0  53.000000       0.0     12
Jane    2022.0      2.0          2.0  41.000000       0.0     12
Jane    2022.0      2.0          1.0  37.000000       0.0     12
Adam    2022.0      3.0          1.0  32.000000       0.0      5
Adam    2022.0      4.0          2.0  34.000000       0.0      5
Adam    2022.0      4.0          3.0  39.000000       0.0      5
George  2021.0      4.0          1.0  56.000000       0.0      7
George  2021.0      1.0          2.0  42.647059      36.0      7
George  2022.0      1.0          1.0  35.000000       0.0      7
George  2022.0      3.0          2.0  42.647059      10.0      7
George  2022.0      3.0          1.0  43.000000       0.0      7
Sally   2021.0      4.0          1.0  50.000000       0.0     15
Sally   2022.0      1.0          1.0  44.000000       0.0     15
Sally   2022.0      2.0          1.0  45.000000       0.0     15
Sally   2022.0      3.0          1.0  57.000000       0.0     15
Sally   2022.0      3.0          2.0  42.647059      31.0     15
Trisha  2022.0      3.0          1.0  41.000000       0.0     20

In [33]:
#reset index will revert index back to the default of 0 to Nrows-1
print(df2.reset_index())
    #By default, the previous index will be stored as a column in the dataset, change this behavior with drop=True
#print(df2.reset_index(drop=True))

    index    Name    Year  Quarter  Transaction      Spent  Refunded CustID
0       0    Jane  2021.0      4.0          1.0  31.000000       0.0     12
1       2    Jane  2022.0      1.0          1.0  53.000000       0.0     12
2       3    Jane  2022.0      2.0          2.0  41.000000       0.0     12
3       4    Jane  2022.0      2.0          1.0  37.000000       0.0     12
4       5    Adam  2022.0      3.0          1.0  32.000000       0.0      5
5       6    Adam  2022.0      4.0          2.0  34.000000       0.0      5
6       7    Adam  2022.0      4.0          3.0  39.000000       0.0      5
7       8  George  2021.0      4.0          1.0  56.000000       0.0      7
8      10  George  2021.0      1.0          2.0  42.647059      36.0      7
9      11  George  2022.0      1.0          1.0  35.000000       0.0      7
10     12  George  2022.0      3.0          2.0  42.647059      10.0      7
11     13  George  2022.0      3.0          1.0  43.000000       0.0      7
12     15   Sally  2021.0      4.0          1.0  50.000000       0.0     15
13     16   Sally  2022.0      1.0          1.0  44.000000       0.0     15
14     17   Sally  2022.0      2.0          1.0  45.000000       0.0     15
15     18   Sally  2022.0      3.0          1.0  57.000000       0.0     15
16     19   Sally  2022.0      3.0          2.0  42.647059      31.0     15
17     20  Trisha  2022.0      3.0          1.0  41.000000       0.0     20

In [34]:
#rename a specific index value using .rename() by feeding a dictionary with Old:New values
print(df2.rename(index={0:50}))
    #can feed multiple Old:New values
#print(df2.rename(index={0:50,1:25}))

      Name    Year  Quarter  Transaction      Spent  Refunded CustID
50    Jane  2021.0      4.0          1.0  31.000000       0.0     12
2     Jane  2022.0      1.0          1.0  53.000000       0.0     12
3     Jane  2022.0      2.0          2.0  41.000000       0.0     12
4     Jane  2022.0      2.0          1.0  37.000000       0.0     12
5     Adam  2022.0      3.0          1.0  32.000000       0.0      5
6     Adam  2022.0      4.0          2.0  34.000000       0.0      5
7     Adam  2022.0      4.0          3.0  39.000000       0.0      5
8   George  2021.0      4.0          1.0  56.000000       0.0      7
10  George  2021.0      1.0          2.0  42.647059      36.0      7
11  George  2022.0      1.0          1.0  35.000000       0.0      7
12  George  2022.0      3.0          2.0  42.647059      10.0      7
13  George  2022.0      3.0          1.0  43.000000       0.0      7
15   Sally  2021.0      4.0          1.0  50.000000       0.0     15
16   Sally  2022.0      1.0          1.0  44.000000       0.0     15
17   Sally  2022.0      2.0          1.0  45.000000       0.0     15
18   Sally  2022.0      3.0          1.0  57.000000       0.0     15
19   Sally  2022.0      3.0          2.0  42.647059      31.0     15
20  Trisha  2022.0      3.0          1.0  41.000000       0.0     20

### String Manipulations
- String processes allow us to manipulate string data
- Regular expressions are necessary for complex string manipulations, but are tricky to master and are outside the scope of this course
    - provide ways to search or match patterns in strings
    
## go through regex for more string manipulation

In [36]:
emaildf=pd.read_excel(r"Customeremail (1).xlsx")
print(emaildf.head(),'\n')
#.contains() tests if the strings contain the specified pattern
print(emaildf['Email'].str.contains('_'),'\n')

#can slice strings
print(emaildf['Email'].str[:5],'\n')

#.split() splits strings based on specified pattern, produces a list
print(emaildf['Email'].str.split('@'),'\n')

#.len() counts the number of characters in a string
print(emaildf['Email'].str.len(),'\n')

     Name  Year  Quarter  Transaction  Spent  Refunded  CustID  \
0    Jane  2022        2            1     37         0      12
1    Adam  2022        3            3     39         0       5
2  George  2022        3            1     43         0       7
3   Sally  2022        3            2      0        31      15
4  Trisha  2022        3            1     41         0      20

                           Email
0           Jane.Smith@yahoo.com
1            Adam.John@gmail.com
2             G_Man_88@gmail.com
3  Sally_Matthews@funcollege.edu
4        teyoun22@thisschool.edu

0    False
1    False
2     True
3     True
4    False
Name: Email, dtype: bool

0    Jane.
1    Adam.
2    G_Man
3    Sally
4    teyou
Name: Email, dtype: object

0             [Jane.Smith, yahoo.com]
1              [Adam.John, gmail.com]
2               [G_Man_88, gmail.com]
3    [Sally_Matthews, funcollege.edu]
4          [teyoun22, thisschool.edu]
Name: Email, dtype: object

0    20
1    19
2    18
3    29
4    23
Name: Email, dtype: int64

### Dummy Variables
- Dummy Variables (also called indicator variables) can be necessary for using categorical variables in some statistical models
- if there are k unique values in a column, there will be k dummy variables
    - each column will contain a 1 for the rows that contain that value, and a 0 for those that do not
    - the k-1 column is redundant and can often be ommited.

In [37]:
#pd.get_dummies() creates dummy variables based on a categorical column
pd.get_dummies(df2,columns=['Name'])
    #by default the name of the column will be used as a prefix, but you can specify a prefix to be used
#pd.get_dummies(df2,columns=['Name'], prefix='ind')

,Year,Quarter,Transaction,Spent,Refunded,CustID,Name_Adam,Name_George,Name_Jane,Name_Sally,Name_Trisha
0,2021.0,4.0,1.0,31.000000,0.0,12,False,False,True,False,False
2,2022.0,1.0,1.0,53.000000,0.0,12,False,False,True,False,False
3,2022.0,2.0,2.0,41.000000,0.0,12,False,False,True,False,False
4,2022.0,2.0,1.0,37.000000,0.0,12,False,False,True,False,False
5,2022.0,3.0,1.0,32.000000,0.0,5,True,False,False,False,False
6,2022.0,4.0,2.0,34.000000,0.0,5,True,False,False,False,False
7,2022.0,4.0,3.0,39.000000,0.0,5,True,False,False,False,False
8,2021.0,4.0,1.0,56.000000,0.0,7,False,True,False,False,False
10,2021.0,1.0,2.0,42.647059,36.0,7,False,True,False,False,False
11,2022.0,1.0,1.0,35.000000,0.0,7,False,True,False,False,False
12,2022.0,3.0,2.0,42.647059,10.0,7,False,True,False,False,False
13,2022.0,3.0,1.0,43.000000,0.0,7,False,True,False,False,False
15,2021.0,4.0,1.0,50.000000,0.0,15,False,False,False,True,False
16,2022.0,1.0,1.0,44.000000,0.0,15,False,False,False,True,False
17,2022.0,2.0,1.0,45.000000,0.0,15,False,False,False,True,False
18,2022.0,3.0,1.0,57.000000,0.0,15,False,False,False,True,False
19,2022.0,3.0,2.0,42.647059,31.0,15,False,False,False,True,False
20,2022.0,3.0,1.0,41.000000,0.0,20,False,False,False,False,True

### Otliers removal

In [38]:
# 
df = pd.DataFrame({
    'Name': ['A', 'B', 'C', 'D', 'E', 'F'],
    'Sales': [100, 120, 130, 115, 800, 110]   # 800 looks like an outlier
})
print("Original Data:\n", df, "\n")

# Step 1: Compute Q1, Q3, and IQR
Q1 = df['Sales'].quantile(0.25)
Q3 = df['Sales'].quantile(0.75)
IQR = Q3 - Q1

# Step 2: Define acceptable range
lower = Q1 - 1.5 * IQR
upper = Q3 + 1.5 * IQR

# Step 3: Keep only rows within range
df_clean = df[(df['Sales'] >= lower) & (df['Sales'] <= upper)]
print("After IQR-based Outlier Removal:\n", df_clean)

Original Data:
   Name  Sales
0    A    100
1    B    120
2    C    130
3    D    115
4    E    800
5    F    110

After IQR-based Outlier Removal:
   Name  Sales
0    A    100
1    B    120
2    C    130
3    D    115
5    F    110

### Binning data

In [39]:
df20 = pd.DataFrame({'Spent': [50, 120, 220, 400, 700]})
print("Original Data:\n", df20, "\n")

# Use pd.cut() to create bins
df20['Spending_Category'] = pd.cut(
    df20['Spent'],
    bins=3,                        # divide into 3 equal-width bins
    labels=['Low', 'Medium', 'High']
)

print("After Binning:\n", df20)

Original Data:
    Spent
0     50
1    120
2    220
3    400
4    700

After Binning:
    Spent Spending_Category
0     50               Low
1    120               Low
2    220               Low
3    400            Medium
4    700              High